Конфигурация/Enums/СостоянияДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>СостоянияДокументов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Записан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Проведен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПомеченНаУдаление</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/CommonModules/РаботаСоСпискомДокументов/Ext/Module.bsl
Процедура ИзменитьСостояниеДокумента(ДанныеДокументов, РежимЗаписи, НовоеСостояниеДокументаПослеЗаписи = Неопределено) Экспорт
	
	Для каждого ДанныеДокумента Из ДанныеДокументов Цикл
		
		ДокументОбъект = ДанныеДокумента.Документ.Получитьобъект();
		
		Если РежимЗаписи = РежимЗаписиДокумента.Запись Тогда
			
			Если      НовоеСостояниеДокументаПослеЗаписи = ПредопределенноеЗначение("Перечисление.СостоянияДокументов.Записан") Тогда // необходимо снять пометку на удаление
				
				Если ДокументОбъект.ПометкаУдаления Тогда
					ДокументОбъект.ПометкаУдаления = Ложь;
					Если Не ЗаписатьДокументЧерезПопытку(ДокументОбъект, РежимЗаписи) Тогда 
						Продолжить;
					КонецЕсли;
				КонецЕсли;
				
			ИначеЕсли НовоеСостояниеДокументаПослеЗаписи = ПредопределенноеЗначение("Перечисление.СостоянияДокументов.ПомеченНаУдаление") Тогда // необходимо установить пометку на удаление
				
				Если ДанныеДокумента.Состояние = Перечисления.СостоянияДокументов.Проведен Тогда
					Если Не ЗаписатьДокументЧерезПопытку(ДокументОбъект, РежимЗаписиДокумента.ОтменаПроведения) Тогда
						Продолжить;
					КонецЕсли;						
				КонецЕсли;
				
				ДокументОбъект.ПометкаУдаления = Истина;
							
				Если Не ЗаписатьДокументЧерезПопытку(ДокументОбъект, РежимЗаписи) Тогда
					Продолжить;
				КонецЕсли;
				
			КонецЕсли;
			
		ИначеЕсли РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			
			Если ДокументОбъект.ПометкаУдаления Тогда
				Продолжить;	
			ИначеЕсли Не ДокументОбъект.ПроверитьЗаполнение() Тогда
				Продолжить;
			КонецЕсли;	
			
			Если Не ЗаписатьДокументЧерезПопытку(ДокументОбъект, РежимЗаписи) Тогда
				Продолжить;
			КонецЕсли;
			
		ИначеЕсли РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда	
			
			Если ДокументОбъект.Проведен Тогда
				Если Не ЗаписатьДокументЧерезПопытку(ДокументОбъект, РежимЗаписи) Тогда
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры // ИзменитьСостояниеДокумента

Функция ЗаписатьДокументЧерезПопытку(ДокументОбъект, РежимЗаписи)
	
	Результат = Ложь;
	
	Попытка 
		ДокументОбъект.Записать(РежимЗаписи);
		Результат = Истина;
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции
